// ignore_for_file: file_names

class CompanyModel {
  String name;
  String img;
  String detail;
  String address;
  String tel;
  String fax;
  String linked;
  String facebook;

  CompanyModel({
    required this.name,
    required this.img,
    required this.detail,
    required this.address,
    required this.tel,
    required this.fax,
    required this.linked,
    required this.facebook,
  });
}

List<CompanyModel> companyModel = [
  CompanyModel(
      name: "شرکت ساختمان و نصب فراب",
      img: "assets/images/sakhteman.jpg",
      detail: """شرکت ساختمان و نصب فراب در سال 1387 با نام «شرکت نوتاش افرا» توسط فراب تاسیس شد. فلسفه تاسیس این شرکت، نصب تجهیزات نیروگاه‌های آبی، حرارتی و سیکل ترکیبی و پروژه‌های صنایع ریلی و نفت، گاز و پتروشیمی با استفاده از تجربه و مهارت ایجاد شده در گروه‌های اجرایی کارگاه‌ها بود. این شرکت تاکنون بیش از 20 پروژه در حوزه‌های نامبرده اجرا کرده است. شرکت ساختمان و نصب فراب با تکیه بر نیروی انسانی با تجربه و ماهر خود و همچنین ابزار مناسب در احداث و نصب تجهیزات مکانیکی (ثابت و دوار) و الکتریکی و نیز عملیات سیویل صنعتی فعال است. این شرکت به طور جدی در ارتقای قابلیت‌های اجرایی و فنی و توسعه حوزه‌های کاری خود تلاش می‌نماید. هدف ما، تبدیل شدن به یک شرکت پیشرو در حوزه نصب و اجرای عملیات سیویل صنعتی پروژه‌های بزرگ و زیربنایی است.

اهداف و راهبردها:

شرکت ساختمان و نصب فراب کسب رضایت مشتریان را سرلوحه اهداف خود قرار داده و به منظور نیل به این هدف، اقدامات زیر را در دستور کار خود قرار داده است:

انتقال دانش فنی متخصصان خارجی به شرکت از طریق همکاری و نظارت در مراحل مختلف پروژه‌ها
ارتقای کیفیت فعالیت‌های اجرایی پروژه‌ها با تاسیس و تقویت واحدهای کنترل کیفی و اطمینان از مرغوبیت
برنامه‌ریزی اجرایی برای تحقق اهداف پروژه‌ها در کوتاهترین زمان ممکن
تجهیز شرکت به تجهیزات و ابزارآلات ویژه و روزآمد برای نصب و راه‌اندازی
دستاوردهای شرکت:

پاسخگویی به نیازهای پروژه‌های مختلف با افزایش انعطاف سازمانی و به‌کارگیری آمیزه‌ای از تیم‌های اجرایی، گروه‌های امانی و پیمانکاران توانمند
کاهش زمان اجرای پروژه‌های نیروگاه‌های برق آبی، از جمله پروژه‌های اجرا شده در کشورهای کنیا و تاجیکستان
انتقال دانش فنی متخصصان خارجی و جایگزین نمودن آنها با کارشناسان ایرانی
تجهیز شرکت به ادوات خاص تست و اندازه‌گیری که پیش از این در اختیار شرکت‌های داخلی و خارجی محدودی قرار داشته است
ایجاد سازمانی مجرب و متخصص جهت نصب و راه‌اندازی پروژه‌های نیروگاه آبی و حرارتی، نفت، گاز و پتروشیمی و صنایع ریلی
جهت کسب اطلاعات بیشتر به وب سایت اینترنتی این شرکت به آدرس www.farab-construction.com مراجعه کنید.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت ناردیس طرهای انرژی",
      img: "assets/images/nardis.jpg",
      detail: """شرکت ناردیس در سال 1385 توسط دو پیمانکار عمومی مشهور ایرانی، شرکت‌های فراب و مهندسی و ساخت تاسیسات دریایی ایران (IOEC) به منظور اجرای پروژه‌های بالادستی و پایین‌دستی در صنعت نفت، گاز و پتروشیمی تاسیس شد.

زمینه‌های فعالیت این شرکت عبارتند از:

توسعه میادین نفت و گاز
تاسیسات فراساحلی
پالایشگاه‌های نفت و گاز
سیستم‌های یوتیلیتی و آفسایت
مجتمع‌های پتروشیمی و صنایع وابسته
ایستگاه‌های تلمبه‌خانه، تقویت فشار و خط لوله
مخازن ذخیره
جهت کسب اطلاعات بیشتر به وب سایت اینترنتی این شرکت به آدرس www.nardisco.com مراجعه کنید.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت ساخت تجهیزات فراب",
      img: "assets/images/sakhteman.jpg",
      detail: """شرکت ساخت تجهیزات فراب در سال 1379 با نام «شرکت مهندسی و مدیریت ساخت توربین‎های برق آبی (توبا)» توسط شرکت فراب و با هدف انتقال دانش و تکنولوژی طراحی، مهندسی و ساخت تجهیزات نیروگاه‌های آبی با استفاده از منابع ساخت داخلی در ایران تاسیس شد. این شرکت، دانش طراحی انواع متعدد تجهیزات توربین آبی و شیر پروانه‌ای نیروگاه‌های آبی را در اختیار دارد. به علاوه از سوابق کاری خوبی در زمینه شبیه‌سازی سیستم‌های تهویه تونلی ریلی و جاده‌ای برخوردار است. شرکت ساخت تجهیزات فراب، تاکنون با همکاری سازندگان داخلی، تجهیزات نیروگاهی شامل توربین‌های آبی، دریچه‌های ورودی، ژنراتور، تجهیزات مکانیکی آبی، جرثقیل دروازه‌ای و سقفی، مخازن تحت فشار، سازه‌های فلزی و تجهیزات یوتیلیتی بویلر، در مجموع به وزن 40,000 تن، را به کارفرمایان خود تحویل داده است.

شرکت ساخت تجهیزات فراب با توجه به عدم تملک کارخانه و یا کارگاه ساخت تجهیزات، تلاش نموده است با شرکت‌های سازنده کوچک و متوسط، تعامل مناسبی را به منظور تکمیل زنجیره تامین تجهیزات برقرار نماید تا علاوه بر کاهش هزینه‌ها و رعایت الزامات کیفی بتوانند به راحتی تغییرات طراحی مد نظر کارفرما را طی فرایند ساخت اعمال نمایند. از طرف دیگر، با افزایش انعطاف‌پذیری این مجموعه­‌ها بتوان به راحتی هر تجهیز را به چند بخش تقسیم نموده و ساخت هر بخش را در یک یا چند کارگاه انجام داد تا بدین ترتیب، علاوه بر افزایش سرعت ساخت، از تخصص، امکانات، ظرفیت کارخانه و یا کارگاه‌­های ساخت مختلف به نحو مطلوبی استفاده نمود.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت های پروژه",
      img: "assets/images/sakhteman.jpg",
      detail: """شرکت سنگاب در سال 1384 در ایران به منظور ارایه خدمات تخصصی برای پروژه سد و نیروگاه سنگتوده 2 در کشور تاجیکستان در حوزه‌های تامین منابع مالی، طراحی و مهندسی، تامین، عملیات ساختمانی، نصب و راه‌اندازی و نیز بهره‌برداری و نگه‌داری از آن به مدت 12 سال تاسیس شد.

""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت نفت و گاز فراب",
      img: "assets/images/a2.jpg",
      detail: """شرکت نفت و گاز فراب در سال 1397 فعالیت رسمی خود را آغاز کرد. این شرکت، یک پیمانکار عمومی است که زنجیره ارزش آن در صنایع پایین‌دستی و میان‌دستی شامل پالایش نفت و گاز، بازاریابی محصولات پتروشیمی، مجتمع‌های NGL وLNG، خطوط نفت و گاز و نیز سرمایه‌گذاری‌های خطرپذیر با تکنولوژی بالا گسترده است.

شرکت نفت و گاز فراب از دانش ایجاد ارزش برای سهامداران از طریق سرمایه‌گذاری، عمل کردن به عنوان یک توسعه‌دهنده کسب و کار، تامین مالی برای پروژه‌های EPC و EPCF، مدیریت سطح بالای پروژه‌ها، مشارکت در کلاس جهانی و مدیریت موثر ریسک‌ها برخوردار است.

این شرکت به ایجاد پایداری و شناخته شدن به عنوان یک پیمانکار عمومی در بخش انرژی و پتروشیمی ایران متعهد است.

قابلیت‌های این شرکت، مدیریت پروژه و تامین منابع مالی می‌باشد.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت بهره برداری و نگهداری فراب",
      img: "assets/images/bahrebardari.jpg",
      detail: """از آنجایی که بهره‌برداری صحیح و دقیق و نگه‌داری و تعمیرات پیشگیرانه در تطابق با استانداردهای بین‌المللی و دستورالعمل‌های سازندگان تجهیزات به تولید برق مطمئن و پایدار با حداقل حوادث در نیروگاه‌ها منجر می‌شود، لذا شرکت بهره‌برداری و نگه‌داری فراب در سال 1391 توسط شرکت فراب با هدف ایجاد یک سیستم بهره‌برداری ایمن برمبنای استانداردهای بین‌المللی و نیز توسعه حوزه‌های کسب و کار تاسیس شد.

لازم به ذکر است که به دلیل پتانسیل موجود در این شرکت، خدمات راه‌اندازی، عیب‌یابی و تعمیرات و نگه‌داری نیروگاه‌ها، به خصوص نیروگاه‌های آبی از اولویت‌های بازاریابی این شرکت هستند. این شرکت در حال حاضر، چندین نیروگاه با ظرفیت 2.194 مگاوات در دست بهره‌برداری دارد.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت مدیریت انرژی و توسعه",
      img: "assets/images/gaz.jpg",
      detail: """شرکت مدیریت انرژی و توسعه طرح‌های تجدیدپذیر در سال 1399 با هدف ارتقاء و توسعه کاربردی انرژی‌های تجدیدپذیر و پاک، و مدیریت انرژی به منظور استفاده کارآمد و بهینه از منابع انرژی تشکیل گردیده است. این شرکت با بهره‌گیری از تجربیات شرکت فراب و با نگاه علمی به موضوعات و به کارگیری پرسنل با تجربه و خلاق در خصوص توسعه طرح‌های تجدیدپذیر، در راستای توسعه، اجرا و بهره برداری از پروژه‌های بهینه‌سازی، هوشمندسازی و مدیریت انرژی (اعم از انرژی های فسیلی و نو) حرکت می‌کند و گام‌های موثری در زمینه همکاری در تهیه و تدوین استانداردها و معیارهای مربوط به حوزه فعالیت شرکت برنامه‌ریزی و اجرا کرده است. در این شرکت کوشش شده است تا اطلاعات اساسی و مورد نیاز در رابطه با حوزه‌های فعالیت و خدمات شرکت در اختیار مشتریان، اساتید، پژوهشگران، دانشجویان و صنعتگران قرار گیرد تا با ارتباطی سازنده از نظرات، پیشنهادات و انتقادات ایشان استفاده و انتظارات مشتریان خود را تأمین کرده و زمینه خدمت‌رسانی بهتر را فراهم نماید. در همین راستا، با ارائه خدمات خرید و فروش، صادرات و واردات هرگونه مواد، مصالح، تجهیزات و ماشین آلات تولیدی، مواد اولیه، قطعات نیم ساخته و لوازم یدکی مرتبط با موضوع فعالیت شرکت، اقدام به تسهیل و شتابدهی توسعه زیرساخت‌های فنی و اقتصادی توسعه طرح‌های مدیریت انرژی و محیط زیست، و همچنین تسهیل اجرایی شدن پروژه‌های تجدیدپذیر کرده است.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت بین المللی مدیریت صادرات",
      img: "assets/images/gaz.jpg",
      detail: """شركت بين المللي مديريت صادرات فراب به عنوان یک شركت تخصصی در حوزه کسب و کار تجاری و ارائه خدمات فني و مهندسي در تلاش است، تا در سایه بازتعریفی جدید از استانداردهای ارائه خدمت در صنعت بازرگاني، کلیه خدمات مورد نیاز افراد، گروه‌ها و بنگاه‌ها را در صنایع گوناگون تأمین نمايد و به طریقی عمل كند که نوید تجربه‌ای متمایز از ارائه خدمات را به مشتریان خود می‌دهیم. تمرکز استراتژیک ما پوشش دادن خلاءهای موجود در حوزه ابزارسازی با رویکرد خدمات بازرگاني، نهادسازی با هدف توسعه زنجیره خدمات، مدیریت ریسک و معاملات ادغام و تملیک به منظور ایجاد هم‌افزایی و ارزش افزوده در کسب و کارها خواهد بود.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
  CompanyModel(
      name: "شرکت تجارت و سرمایه گروه فراب",
      img: "assets/images/nardis.jpg",
      detail: """شرکت تجارت و سرمایه گروه فراب در سال ۱۳۸۴ با نام «شرکت سرمایه‌گذاری کارکنان فراب» توسط شرکت فراب تاسیس شد. ماموریت اصلی این شرکت، رفع دغدغه نیروی انسانی با ارزش گروه فراب در زمینه کسب منافع و ارزش افزوده‌های موجود در فضای کسب و کار داخل و خارج کشور به نفع سرمایه‌ها و اندوخته‌های ایشان بوده است تا بدین ترتیب ضمن ایجاد یک سازمان کارآفرین و پویا، منافع کوتاه مدت و بلندمدت سهامداران تامین شود. سبد سرمایه‎گذاری این شرکت شامل موارد زیر است:

تامین نیروی انسانی
تامین ماشین‌آلات
معدن
پروژه‌های ساختمانی
مالی، سرمایه و بورس
تجارت و بازرگانی
خدمات
جهت کسب اطلاعات بیشتر به وب سایت اینترنتی این شرکت به آدرس www.farab-invest.com مراجعه کنید.""",
      address: "address",
      tel: "tel",
      fax: "fax",
      linked: "linked",
      facebook: "facebook"),
];
