// ignore_for_file: file_names

class HozeModel {
  String name;
  String img;
  String detail;

  HozeModel({
    required this.name,
    required this.img,
    required this.detail,
  });
}

List<HozeModel> hozeModel = [
  HozeModel(
      name: "نیرو",
      img: "assets/images/niro.jpg",
      detail:
          "شرکت فراب در سال 1371 فعالیت رسمی خود را به عنوان پیمانکار عمومی احداث نیروگاه‌های آبی در کشور آغاز کرد. پس از گذشت بیش از یک دهه از احداث نیروگاه‌های آبی در کشور توسط فراب، با توجه به محدودیت پتانسیل رشد این حوزه در کشور و با تکیه بر توانمندی‎های فنی، مهندسی و اجرایی خود تصمیم گرفت تا به حوزه نیروگاه‌های آبی در خارج از کشور و نیز حوزه نیروگاه‌های حرارتی وارد شود. عملکرد موفق فراب موجب دستیابی به این اهداف شد. اکنون با گذشت بیش از دو دهه از آغاز فعالیت، ارزش پروژه‌های این شرکت در حوزه نیروگاهی، میلیون‌ها دلار است. این شرکت تاکنون 86 واحد نیروگاهی را با ظرفیت 11,190 مگاوات اجرا نموده و 2,797.2 مگاوات، شامل 784.2 مگاوات نیروگاه آبی و 2,013 مگاوات نیروگاه حرارتی، در دست اجرا دارد."),
  HozeModel(
      name: "صنایع ریلی",
      img: "assets/images/reil.jpg",
      detail:
          "توسعه صنایع ریلی، یکی از پیش‌نیازهای توسعه پایدار شهرهای بزرگ ایران است. فراب در سال 1388 به پشتوانه تجربیات موفق خود در سایر بخش‌های صنعتی و داخلی تصمیم گرفت تا در این حوزه ورود نماید."),
  HozeModel(
      name: "نفت، گاز و پتروشیمی",
      img: "assets/images/gaz.jpg",
      detail:
          "فراب در سال 1384 به حوزه نفت، گاز و پتروشیمی وارد شد و تاکنون 15 پروژه بالادستی و پایین دستی را به روش EPC اخذ نموده است. گروه فراب در توسعه میادین نفت و گاز، مجتمع‌های فراساحلی، پالایشگاه‌های نفت و گاز، واحدهای یوتیلیتی و آفسایت، مجتمع‌های پتروشیمی و صنایع وابسته، خطوط لوله، ایستگاه‌‌های تقویت فشار و تلمبه‌خانه و نیز مخازن نفت فعالیت می‎کند."),
  HozeModel(
      name: "آب",
      img: "assets/images/ab.jpg",
      detail:
          "با توجه به بحران جهانی آب، خصوصا در خاورمیانه، امروزه در مورد استفاده از آب دریا به عنوان یک منبع ثابت برای تولید آب نمک‎زدایی شده جهت مصارف آشامیدنی و صنعتی بیشتر می‌شنویم. نمک‎زدایی، یک فرایند جداسازی است که برای کاهش میزان نمک محلول در آب شور به یک سطح قابل مصرف استفاده می‎شود. این فرایند، آب شور را به دو جریان جدا می‎کند: یک جریان با غلظت کم املاح نمک و دیگری حاوی نمک‎های املاح باقی‎مانده (جریان غلیظ یا شورآب). واحدهای شیرین‎سازی آب برای بهره‎برداری نیازمند به‎کارگیری انرژی هستند و می‎توانند از دو تکنولوژی متفاوت برای جداسازی آب استفاده کنند: تقطیر چندمرحله‎ای (MED (Multi Effect Distillation)) و اسمز معکوس (RO (Reverse Osmosis))."),
  HozeModel(
      name: "ساختمان",
      img: "assets/images/sakhteman.jpg",
      detail:
          "هدف فراب، تبدیل شدن به یک شرکت سیویل بین‌المللی، متخصص و با تجربه در اجرای پروژه‌های بزرگ است. ما محدوده وسیعی از کارهای سیویل نظیر احداث نیروگاه‌ها، تونل و جاده‌ را پوشش می‎دهیم. درنتیجه تجربیات اخیر ما در حوزه‌های مختلف سیویل، همکاران متخصص و تجهیزات مدرن، می‎توانیم در محدوده گسترده‌ای از حوزه سیویل، برای کارفرمایان ارزش خلق نماییم."),
  HozeModel(
      name: "بهره برداری",
      img: "assets/images/bahrebardari.jpg",
      detail:
          "شرکت بهره‌برداری و نگه‌داری فراب در سال 1391 به منظور بهره‌برداری، تعمیرات و نگه‌داری از نیروگاه‌ها تاسیس شد. در حال حاضر، این شرکت، بهره‌برداری و نگه‌داری از 5 نیروگاه در ایران و یک نیروگاه در خارج از ایران و نظارت بر بهره‌برداری یک نیروگاه در خارج از کشور را برعهده دارد."),
  HozeModel(
      name: "شبکه های هوشمند",
      img: "assets/images/hoshmand.jpg",
      detail:
          "پس از اجرا و بهره‌برداری موفق از پروژه‌های آزمایشی 2000*2 نقطه اندازه‌گیری هوشمند برق (پروژه فهام) در استان‌های زنجان و بوشهر توسط شرکت فراب، پروژه فهام وارد فاز اجرایی شد و در حال حاضر بیش از 50,000 نقطه اندازه‌گیری هوشمند برق، توسط شرکت فراب در 13 شرکت توزیع برق در 11 استان راه‌اندازی شده و در حال بهره‌برداری است. پروژه‌های در حال اجرای شرکت فراب در حوزه کنتورهای هوشمند برق تا نصب و راه‌اندازی 350,000 کنتور هوشمند ادامه خواهد یافت."),
];
