// ignore_for_file: file_names

class NewsModel {
  String onvan;
  String sherkat;
  String detail;
  String img;

  NewsModel({
    required this.onvan,
required this.sherkat,
required this.detail,
required this.img,
  });
}

List<NewsModel> newsModels= [

NewsModel(onvan: """نقشه راه رشد غیر تورمی – 1400""", sherkat: "اخبار ستاد", detail: """ایستگاه «مدافعان سلامت» در خط 7 مترو تهران با دستور رئیس‌جمهور از طریق ویدئو کنفرانس و با حضور شهردار تهران و جمعی از مدیران شهری در محل این ایستگاه، روز پنج‌شنبه بیست و هفتم خردادماه 1400 افتتاح شد.

به گزارش روابط عمومی شرکت فراب، ایستگاه مدافعان سلامت در خط ۷ مترو تهران، در مجاورت بیمارستان امام خمینی (ره) قرار دارد و به پاس قدردانی از زحمات مدافعان سلامت در دوران شیوع ویروس کرونا، نام آن از «باقرخان» به «مدافعان سلامت» تغییر یافت.

خط ۷ مترو تهران به‌طول ۲۷ کیلومتر و با دارا بودن ۲۲ ایستگاه، از ورزشگاه جهان پهلوان تختی در جنوب شرق تهران آغاز و پس از عبور از مناطق پر جمعیتی مانند بزرگراه شهید آیت‌الله محلاتی، خیابان مولوی، خیابان هلال احمر، خیابان قزوین، بزرگراه شهید نواب صفوی، خیابان آزادی، میدان توحید، برج و بیمارستان میلاد و میدان صنعت، به میدان کتاب در سعادت‌آباد ختم می‌شود.

شرکت‌ فراب، پیمانکار EPC طراحی، تأمین و اجرای تجهیزات پروژه خط 7 مترو تهران است.""", img: "assets/images/newsimg/N1.jpg"),


NewsModel(onvan: """میزبانی گروه فراب از جمع زیادی از دست‌اندرکاران و فعالان صنعت برق ایران""", sherkat: "اخبار ستاد", detail: """گروه فراب با حضور فعال در بیست و یکمین نمایشگاه بین‌المللی صنعت برق ایران، میزبان جمع زیادی از مدیران، دست‌اندرکاران، فعالان دانشگاهی و متخصصان صنعت برق کشور بود.

به‌ گزارش روابط عمومی شرکت فراب، بیست و یکمین نمایشگاه بین‌المللی صنعت برق ایران به مدت چهار روز و طی روزهای هفتم تا دهم آبان‌ماه امسال در 11 سالن نمایشگاهی به وسعت 40 هزار متر مربع در محل دائمی نمایشگاه‌های بین‌المللی تهران برگزار شد.

در این دوره از نمایشگاه که با حضور وزیر نیرو آغاز به کار کرده بود، 284 شرکت داخلی و خارجی از جمله گروه فراب حضور داشتند.""", img: "assets/images/newsimg/N2.jpg"),
NewsModel(onvan: """معرفی پروژه‌های گروه فراب در حوزه انرژی‌های تجدیدپذیر به وزیر نیرو""", sherkat: "اخبار ستاد", detail: """وزیر نیرو در بازدید از غرفه گروه فراب در نخستین روز از بیست و یکمین نمایشگاه بین‌المللی صنعت برق ایران، با پروژه‌های گروه فراب در حوزه انرژی‌های تجدیدپذیر آشنا شد و برنامه‌های فراب در این حوزه برای وی تشریح شد.
به گزارش روابط عمومی شرکت فراب، بیست و یکمین نمایشگاه بین‌المللی صنعت برق ایران، صبح جمعه هفتم آبان‌ماه 1400 با حضور وزیر نیرو و جمعی از معاونان و مدیران ارشد صنعت برق کشور و تعدادی از میهمانان در محل دائمی نمایشگاه‌های بین‌المللی تهران آغاز به‌کار کرد.""", img: "assets/images/newsimg/N3.jpg"),

NewsModel(onvan: """شهریور ماه پُربار گروه فراب در توسعه کسب و کارها""", sherkat: "اخبار ستاد", detail: """شهریورماه گذشته، ماه پُرباری برای توسعه کسب و کارهای گروه فراب بود و علاوه بر موفقیت در گرفتن پروژه‌های خط 3 مترو مشهد، خط A مترو قم و ساخت مخزن 50 هزار متر مکعبی برای ذخیره‌‌سازی آب خام شرکت مجتمع جهان فولاد سیرجان، فراب به عنوان برنده مناقصه نیروگاه خورشیدی 10 مگاواتی زاهدان اعلام شد. همچنین امضا و ابلاغ دو تفاهم‌نامه «تأمین مالی و احداث راه‌آهن زاهدان – بیرجند به صورت DB+F یا EPC+F توسط شرکت فراب» و «همکاری بین شرکت بهره‌برداری قطار شهری مشهد و شرکت فراب» در حوزه حمل و نقل ریلی، از دیگر موفقیت‌های گروه فراب در شهریورماه بود.""", img: "assets/images/newsimg/N4.jpg"),

NewsModel(onvan: """واکسینه شدن افزون بر 2360 نفر از همکاران گروه فراب و خانواده‌های آنان در مقابل کرونا""", sherkat: "اخبار ستاد", detail: """با واکسیناسیون 1806 نفر از همکاران گروه فراب و 554 نفر از خانواده‌های آنان در مقابل ویروس کرونا، 81 درصد از کارکنان دوز اول واکسن و 32 درصد نیز دوز دوم واکسن را تزریق کردند.

به گزارش روابط عمومی شرکت فراب و بر اساس اعلام مدیریت ایمنی و حراست شرکت، آمار واکسیناسیون کووید 19 پرسنل گروه فراب در ستاد مرکزی و همچنین پروژه‌های داخلی و خارجی گروه تا تاریخ 28 شهریورماه امسال به عدد 2360 نفر رسیده که شامل 1806 نفر از همکاران و 554 نفر از خانواده‌های آنان است.

بر اساس این گزارش، از مجموع 2211 نفر همکاران گروه فراب شامل همکاران شاغل در شرکت‌های مستقر در دفاتر تهران و همچنین همکاران شاغل در نیروگاه‌ها و پروژه‌های اومااویا (سریلانکا)، آزاد، داریان، سیمره، درالوک (کردستان عراق)، سنگ‌توده (تاجیکستان)، پارس جنوبی، گتوند، شیرکوه یزد، دالاهو، رودبار لرستان، سردشت و پروژه خط 2 قطار شهری مشهد، 1806 نفر معادل 81 درصد، دوز اول واکسن و 727 نفر معادل 32 درصد، دوز دوم واکسن را تزریق کرده‌اند.""", img: "assets/images/newsimg/N5.jpg"),


NewsModel(onvan: """شماره 74 نشریه فراب ویژه خرداد، تیر و مرداد 1400 منتشر شد""", sherkat: "اخبار ستاد", detail: """فرآیند دمونتاژ تجهیزات دستگاه حفار TBM از داخل تونل آزاد و حمل آن به محوطه دپو، طی مدت 11 روز به انجام رسید که رکورد مناسبی در این زمینه محسوب می‌شود.

به گزارش روابط عمومی شرکت فراب، دمونتاژ بخش‌های مختلف دستگاه TBM مشتمل بر سپرها، اسکرو و نوار نقاله، درام‌ها، هیدروموتورها و الکتروموتورها، گنتری‌ها و …، توسط پرسنل اجرایی حاضر در محل پروژه انجام شد.

همچنین با به‌کارگیری تمهیداتی برای استفاده از مسیرهای روستایی در سطح منطقه و صرفه‌جویی در هزینه‌های سنگین احداث جاده دسترسی به محل، عملیات دمونتاژ و حمل دستگاه TBM به محوطه دپو، طی زمان 11 روز شدند که رکورد مناسبی در این زمینه محسوب می‌شود.""", img: "assets/images/newsimg/N6.jpg"),
NewsModel(onvan: """ثبت رکورد در انجام فرایند دمونتاژ، بارگیری و حمل قطعات TBM تونل آزاد طی 11 روز""", sherkat: "اخبار ستاد", detail: "detail", img: "assets/images/newsimg/N7.jpg"),

NewsModel(onvan: """«شرکت مدیریت انرژی و توسعه طرح‌های تجدیدپذیر فراب» در جمع شرکت‌های دانش‌بنیان کشور قرار گرفت""", sherkat: "sherkat", detail: "detail", img: "assets/images/newsimg/N8.jpg"),


NewsModel(onvan: """حضور گروه فراب در نمایشگاه اختصاصی جمهوری اسلامی ایران در ارمنستان""", sherkat: "اخبار ستاد", detail: """توانمندی‌های گروه فراب در نمایشگاه اختصاصی جمهوری اسلامی ایران در ارمنستان معرفی شد.

به گزارش روابط عمومی شرکت فراب، نمایشگاه اختصاصی جمهوری اسلامی ایران در ارمنستان، طی روزهای 20 تا 23 خردادماه امسال در مرکز نمایشگاه‌های بین‌المللی ایروان با حضور ده‌ها شرکت ایرانی شامل سازندگان تجهیزات برقی، سازندگان تجهیزات مکانیکی، تأمین‌کنندگان تجهیزات ساختمانی، تولیدکنندگان و توزیع‌کنندگان مواد غذایی، تولید‌کنندگان صنایع دستی و …، برگزار شد.

نمایندگان گروه فراب در این نمایشگاه، قائم مقام مدیر عامل در امور اقتصادی و تجارت، معاون بازرگانی، مدیر تأمین تجهیزات برق و ابزار دقیق و مشاور معاون بازرگانی بودند که ضمن معرفی توانمندی‌ها و قابلیت‌های گروه در زمینه اجرای نیروگاه‌های آبی، حرارتی و خورشیدی؛ انرژی‌های تجدیدپذیر؛ کنتورهای هوشمند؛ نفت و گاز و پتروشیمی و طرح‌های صنایع ریلی، چندین نشست کاری و مذاکره‌ای با نمایندگان سازمان‌ها و شرکت‌هایی از کشور ارمنستان برگزار کردند.""", img: "assets/images/newsimg/N9.jpg"),

NewsModel(onvan: """ایستگاه مدافعان سلامت در خط 7 مترو تهران افتتاح شد""", sherkat: "اخبار ستاد", detail: """ایستگاه «مدافعان سلامت» در خط 7 مترو تهران با دستور رئیس‌جمهور از طریق ویدئو کنفرانس و با حضور شهردار تهران و جمعی از مدیران شهری در محل این ایستگاه، روز پنج‌شنبه بیست و هفتم خردادماه 1400 افتتاح شد.

به گزارش روابط عمومی شرکت فراب، ایستگاه مدافعان سلامت در خط ۷ مترو تهران، در مجاورت بیمارستان امام خمینی (ره) قرار دارد و به پاس قدردانی از زحمات مدافعان سلامت در دوران شیوع ویروس کرونا، نام آن از «باقرخان» به «مدافعان سلامت» تغییر یافت.

خط ۷ مترو تهران به‌طول ۲۷ کیلومتر و با دارا بودن ۲۲ ایستگاه، از ورزشگاه جهان پهلوان تختی در جنوب شرق تهران آغاز و پس از عبور از مناطق پر جمعیتی مانند بزرگراه شهید آیت‌الله محلاتی، خیابان مولوی، خیابان هلال احمر، خیابان قزوین، بزرگراه شهید نواب صفوی، خیابان آزادی، میدان توحید، برج و بیمارستان میلاد و میدان صنعت، به میدان کتاب در سعادت‌آباد ختم می‌شود.

شرکت‌ فراب، پیمانکار EPC طراحی، تأمین و اجرای تجهیزات پروژه خط 7 مترو تهران است.""", img: "assets/images/newsimg/N10.jpg")

];